Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/implementation-notes_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: implementation-notes title: Implementation Notes layout: contributing permalink: docs/implementation-notes.html prev: codebase-overview.html next: design-principles.html redirect_from:
ja: --- id: implementation-notes title: 実装に関するメモ layout: contributing permalink: docs/implementation-notes.html prev: codebase-overview.html next: design-principles.html redirect_from:

source: This section is a collection of implementation notes for the [stack reconciler](/docs/codebase-overview.html#stack-reconciler).
ja: この章は [stack リコンサイラ (reconciler)](/docs/codebase-overview.html#stack-reconciler) の実装に関するメモを集めたものです。

source: It is very technical and assumes a strong understanding of React public API as well as how it's divided into core, renderers, and the reconciler.
ja: これは非常に技術的な内容であり、React の公開 API だけでなく、React がどのようにコア、レンダラ (renderer) 、そしてリコンサイラに分割されているかについても、深く理解していることを前提としています。

source: If you're not very familiar with the React codebase, read [the codebase overview](/docs/codebase-overview.html) first.
ja: React のコードベースにあまり精通していないのであれば、まず[コードベースの概要](/docs/codebase-overview.html)を読んでください。

source: It also assumes an understanding of the [differences between React components, their instances, and elements](/blog/2015/12/18/react-components-elements-and-instances.html).
ja: また、これは [React のコンポーネント、インスタンスおよび要素の違い](/blog/2015/12/18/react-components-elements-and-instances.html)についての理解を前提としています。

source: The stack reconciler was used in React 15 and earlier.
ja: stack リコンサイラは、React 15 およびそれ以前のバージョンで使われていました。

source: It is located at [src/renderers/shared/stack/reconciler](https://github.com/facebook/react/tree/15-stable/src/renderers/shared/stack/reconciler).
ja: [src/renderers/shared/stack/reconciler](https://github.com/facebook/react/tree/15-stable/src/renderers/shared/stack/reconciler) で見つけることができます。

source: ### Video: Building React from Scratch {#video-building-react-from-scratch}
ja: ### 動画：React をスクラッチで作成する {#video-building-react-from-scratch}

source: [Paul O'Shannessy](https://twitter.com/zpao) gave a talk about [building React from scratch](https://www.youtube.com/watch?v=_MAD4Oly9yg) that largely inspired this document.
ja: このドキュメントは、[Paul O'Shannessy](https://twitter.com/zpao) 氏の行った講演 [building React from scratch](https://www.youtube.com/watch?v=_MAD4Oly9yg) に大いに啓発されています。

source: Both this document and his talk are simplifications of the real codebase so you might get a better understanding by getting familiar with both of them.
ja: このドキュメントと彼の講演は、ともに実際のコードベースを簡素化したもので、両方に親しむことでより深く理解することができるでしょう。

source: ### Overview {#overview}
ja: ### 概要 {#overview}

source: The reconciler itself doesn't have a public API.
ja: リコンサイラそのものは公開 API を持ちません。

source: [Renderers](/docs/codebase-overview.html#renderers) like React DOM and React Native use it to efficiently update the user interface according to the React components written by the user.
ja: リコンサイラは、React DOM や React Native のような [レンダラ](/docs/codebase-overview.html#renderers) が、ユーザの記述した React コンポーネントに応じてユーザインターフェースを効率よく更新するために使用されます。

source: ### Mounting as a Recursive Process {#mounting-as-a-recursive-process}
ja: ### 再帰的な処理としてマウントする {#mounting-as-a-recursive-process}

source: Let's consider the first time you mount a component:
ja: 一番最初にコンポーネントをマウントするときのことを考えてみましょう：

source: React DOM will pass `<App />` along to the reconciler.
ja: React DOM はリコンサイラに `<App />` を渡します。

source: Remember that `<App />` is a React element, that is, a description of *what* to render.
ja: `<App />` が React 要素であること、つまり、**何**をレンダーするかの説明書きであることを思い出してください。

source: You can think about it as a plain object:
ja: これはプレーンなオブジェクトとして考えることができます：

source: The reconciler will check if `App` is a class or a function.
ja: リコンサイラは `App` がクラスか関数かをチェックします。

source: If `App` is a function, the reconciler will call `App(props)` to get the rendered element.
ja: もし `App` が関数なら、リコンサイラは `App(props)` を呼び出してレンダーされた要素を取得します。

source: If `App` is a class, the reconciler will instantiate an `App` with `new App(props)`, call the `componentWillMount()` lifecycle method, and then will call the `render()` method to get the rendered element.
ja: もし `App` がクラスなら、リコンサイラは `new App(props)` で `App` をインスタンス化し、`componentWillMount()` ライフサイクルメソッドを呼び出し、それから `render()` メソッドを呼び出してレンダーされた要素を取得します。

source: Either way, the reconciler will learn the element `App` "rendered to".
ja: どちらにせよ、リコンサイラは `App` が「レンダーされた」結果となる要素を手に入れます。

source: This process is recursive.
ja: このプロセスは再帰的です。

source: `App` may render to a `<Greeting />`, `Greeting` may render to a `<Button />`, and so on.
ja: `App` は `<Greeting />` へとレンダーされるかもしれませんし、`Greeting` は `<Button />` にレンダーされるかもしれない、といったように続いていきます。

source: The reconciler will "drill down" through user-defined components recursively as it learns what each component renders to.
ja: リコンサイラはそれぞれのコンポーネントが何にレンダーされるかを学習しながら、ユーザ定義コンポーネントを再帰的に「掘り下げて」いきます。

source: You can imagine this process as a pseudocode:
ja: この処理の流れは擬似コードで想像することができます：

source: >**Note:** > >This really *is* a pseudo-code.
ja: >**補足：** > >これは**全くの**擬似コードです。

source: It isn't similar to the real implementation.
ja: 本物の実装に近いものではありません。

source: It will also cause a stack overflow because we haven't discussed when to stop the recursion.
ja: また、いつ再帰を止めるか検討していないため、このコードはスタックオーバーフローを引き起こします。

source: Let's recap a few key ideas in the example above:
ja: 上記の例でいくつかの鍵となるアイデアをおさらいしましょう：

source: * React elements are plain objects representing the component type (e.g. `App`) and the props.
ja: * React 要素とはコンポーネントの型（例えば `App`）と props を表すプレーンなオブジェクトである。

source: * User-defined components (e.g. `App`) can be classes or functions but they all "render to" elements.
ja: * ユーザ定義コンポーネント（例えば `App`）はクラスであっても関数であってもよいが、それらは全て要素へと「レンダーされる」。

source: * "Mounting" is a recursive process that creates a DOM or Native tree given the top-level React element (e.g. `<App />`).
ja: * 「マウント」とは、最上位の React 要素（例えば `<App />`）を受け取り、DOM もしくはネイティブなツリーを構築する再帰的な処理である。

source: ### Mounting Host Elements {#mounting-host-elements}
ja: ### host要素のマウント {#mounting-host-elements}

source: This process would be useless if we didn't render something to the screen as a result.
ja: このようにして要素ができても、それを使って画面に何か表示しなければ意味がありません。

source: In addition to user-defined ("composite") components, React elements may also represent platform-specific ("host") components.
ja: ユーザ定義 ("composite") コンポーネントに加え、React 要素はプラットフォームに固有な ("host") コンポーネントも表すことができます。

source: For example, `Button` might return a `<div />` from its render method.
ja: 例えば、`Button` は render メソッドから `<div />` を返すことが考えられます。

source: If element's `type` property is a string, we are dealing with a host element:
ja: もし要素の `type` プロパティが文字列なら、私たちはいま host 要素を扱っていることになります：

source: There is no user-defined code associated with host elements.
ja: host 要素に関連付けられているユーザ定義のコードはありません。

source: When the reconciler encounters a host element, it lets the renderer take care of mounting it.
ja: リコンサイラは host 要素を見つけると、レンダラに host 要素のマウントを任せます。

source: For example, React DOM would create a DOM node.
ja: 例えば、React DOM は DOM ノードを生成します。

source: If the host element has children, the reconciler recursively mounts them following the same algorithm as above.
ja: host 要素に子要素がある場合、リコンサイラは前節で述べたものと同じアルゴリズムに従い、子要素を再帰的にマウントします。

source: It doesn't matter whether children are host (like `<div><hr /></div>`), composite (like `<div><Button /></div>`), or both.
ja: 子要素が（`<div><hr /></div>` のような）host なのか、（`<div><Button /></div>` のような）composite なのか、もしくはその両方が含まれているかに関わらず、再帰的な処理が実行されます。

source: The DOM nodes produced by the child components will be appended to the parent DOM node, and recursively, the complete DOM structure will be assembled.
ja: 子コンポーネントにより生成された DOM ノードは親の DOM ノードに追加され、それが再帰的に行われることで、完全な DOM 構造が組み立てられます。

source: >**Note:** > >The reconciler itself is not tied to the DOM.
ja: >**補足：** > >リコンサイラそのものは DOM と結合していません。

source: The exact result of mounting (sometimes called "mount image" in the source code) depends on the renderer, and can be a DOM node (React DOM), a string (React DOM Server), or a number representing a native view (React Native).
ja: マウントの結果自体（時にソースコードでは "mount image" とも呼ばれます）はレンダラに依存し、それは（React DOM なら）DOM ノード であったり、（React DOM Server なら）文字列であったり、（React Native なら）ネイティブのビューを表す数字であったりします。

source: If we were to extend the code to handle host elements, it would look like this:
ja: 前出のコードを host 要素も扱えるように拡張するとすれば、以下のようなものになるでしょう：

source: // Children may be host (e.g. <div />) or composite (e.g. <Button />).
ja: // Children may be host (e.g.<div />) or composite (e.g.

source: // We will also mount them recursively:
ja: <Button />).// We will also mount them recursively:

source: This is working but still far from how the reconciler is really implemented.
ja: このコードは動作しますが、それでもまだ現実のリコンサイラの実装方法からは隔たりがあります。

source: The key missing ingredient is support for updates.
ja: ここにあるべき鍵となる要素は、更新に対応することです。

source: ### Introducing Internal Instances {#introducing-internal-instances}
ja: ### 内部インスタンスの導入 {#introducing-internal-instances}

source: The key feature of React is that you can re-render everything, and it won't recreate the DOM or reset the state:
ja: React の鍵となる機能は、あらゆるものを再描画できることであり、その際に DOM を再生成したり、state をリセットしたりしないことです：

source: However, our implementation above only knows how to mount the initial tree.
ja: しかし、前節で実装したコードは最初のツリーをマウントする方法しか知りません。

source: It can't perform updates on it because it doesn't store all the necessary information, such as all the `publicInstance`s, or which DOM `node`s correspond to which components.
ja: 前節のコードは、全ての `publicInstance` や、どの DOM `node` がどのコンポーネントに対応しているかなど、必要な全情報を保有しているわけではないので、更新を実行することができません。

source: The stack reconciler codebase solves this by making the `mount()` function a method and putting it on a class.
ja: stack リコンサイラのコードベースでは、この問題を `mount()` 関数をメソッドとしてクラスに置くことで解決しています。

source: There are drawbacks to this approach, and we are going in the opposite direction in the [ongoing rewrite of the reconciler](/docs/codebase-overview.html#fiber-reconciler).
ja: しかしこのアプローチには欠点があるため、[進行中のリコンサイラの書き直し作業](/docs/codebase-overview.html#fiber-reconciler)では、反対の方向に進んでいます。

source: Nevertheless this is how it works now.
ja: それでも現時点では、この方式で動作しています。

source: Instead of separate `mountHost` and `mountComposite` functions, we will create two classes: `DOMComponent` and `CompositeComponent`.
ja: 別々の `mountHost` と `mountComposite` 関数の代わりに、2 つのクラスを作成します： `DOMComponent` と `CompositeComponent` です。

source: Both classes have a constructor accepting the `element`, as well as a `mount()` method returning the mounted node.
ja: 両方のクラスが `element` を受け入れるコンストラクタと、マウントされたノードを返す `mount()` メソッドを持ちます。

source: We will replace a top-level `mount()` function with a factory that instantiates the correct class:
ja: 最上位の `mount()` 関数を、正しいクラスをインスタンス化するファクトリに置き換えます：

source: First, let's consider the implementation of `CompositeComponent`:
ja: まず、`CompositeComponent` の実装から考えてみましょう：

source: This is not much different from our previous `mountComposite()` implementation, but now we can save some information, such as `this.currentElement`, `this.renderedComponent`, and `this.publicInstance`, for use during updates.
ja: 以前の `mountComposite()` の実装と大きな違いはありませんが、更新時に使用する `this.currentElement` 、`this.renderedComponent` や、`this.publicInstance` のような情報を保存できるようになりました。

source: Note that an instance of `CompositeComponent` is not the same thing as an instance of the user-supplied `element.type`.
ja: `CompositeComponent` のインスタンスは、ユーザが指定する `element.type` のインスタンスとは同一ではないことに注意してください。

source: `CompositeComponent` is an implementation detail of our reconciler, and is never exposed to the user.
ja: `CompositeComponent` はリコンサイラの実装の詳細であり、ユーザには決して公開されません。

source: The user-defined class is the one we read from `element.type`, and `CompositeComponent` creates an instance of it.
ja: ユーザ定義クラスとは `element.type` から読み込むものであり、`CompositeComponent` がそのインスタンスを作成するのです。

source: To avoid the confusion, we will call instances of `CompositeComponent` and `DOMComponent` "internal instances".
ja: 混乱を避けるために、`CompositeComponent` と `DOMComponent` のインスタンスを「内部インスタンス」と呼ぶことにします。

source: They exist so we can associate some long-lived data with them.
ja: 内部インスタンスは、長期間利用されるデータとそれらを関連付けられるようにするために存在します。

source: Only the renderer and the reconciler are aware that they exist.
ja: それらの存在はレンダラとリコンサイラのみが認識しています。

source: In contrast, we call an instance of the user-defined class a "public instance".
ja: 一方、ユーザ定義クラスのインスタンスは「公開インスタンス」と呼ぶことにします。

source: The public instance is what you see as `this` in the `render()` and other methods of your custom components.
ja: 公開インスタンスは、独自コンポーネントの `render()` やその他のメソッド内で `this` として現れるものです。

source: The `mountHost()` function, refactored to be a `mount()` method on `DOMComponent` class, also looks familiar:
ja: `mountHost()` 関数は、`DOMComponent` クラスの `mount()` メソッドとしてリファクタリングされ、こちらも見慣れたものになります：

source: The main difference after refactoring from `mountHost()` is that we now keep `this.node` and `this.renderedChildren` associated with the internal DOM component instance.
ja: mountHost() からリファクタリングした後の主な違いは、`this.node` と `this.renderedChildren` を内部の DOM コンポーネントインスタンスに関連付け続けていることです。

source: We will also use them for applying non-destructive updates in the future.
ja: これらは、将来的に非破壊的な更新を適用する際にも使用します。

source: As a result, each internal instance, composite or host, now points to its child internal instances.
ja: 結果として、それが composite であれ host であれ、内部インスタンスはそれぞれの子内部インスタンスを指すようになります。

source: To help visualize this, if a function `<App>` component renders a `<Button>` class component, and `Button` class renders a `<div>`, the internal instance tree would look like this:
ja: `<App>` 関数コンポーネントが `<Button>` コンポーネントをレンダーし、`<Button>` クラスが `<div>`をレンダーする場合、視覚的にわかりやすくすると、内部インスタンスのツリーはこのようになります：

source: In the DOM you would only see the `<div>`.
ja: DOM の中では、`<div>`しか見えません。

source: However the internal instance tree contains both composite and host internal instances.
ja: しかしながら、内部インスタンスのツリーは composite の内部インスタンスと host の内部インスタンスの両方を保有しています。

source: The composite internal instances need to store:
ja: composite 内部インスタンスは以下のものを格納する必要があります：

source: * The current element.
ja: * 現在の要素。

source: * The public instance if element type is a class.
ja: * 要素の型がクラスの場合、公開インスタンス。

source: * The single rendered internal instance.
ja: * 単独の、レンダーされた内部インスタンス。

source: It can be either a `DOMComponent` or a `CompositeComponent`.
ja: これは `DOMComponent` か `CompositeComponent` のいずれかにあたります。

source: The host internal instances need to store:
ja: host 内部インスタンスは以下のものを格納する必要があります：

source: * The DOM node.
ja: * DOM ノード。

source: * All the child internal instances.
ja: * すべての子内部インタスタンス。

source: Each of them can be either a `DOMComponent` or a `CompositeComponent`.
ja: 各インスタンスは、`DOMComponent` または `CompositeComponent` のいずれかになります。

source: If you're struggling to imagine how an internal instance tree is structured in more complex applications, [React DevTools](https://github.com/facebook/react-devtools) can give you a close approximation, as it highlights host instances with grey, and composite instances with purple:
ja: より複雑なアプリケーションにおいて、内部インスタンスのツリーがどのような構造になるのか想像しづらい場合は、[React DevTools](https://github.com/facebook/react-devtools) が host インスタンスを灰色に、composite インスタンスを紫色にハイライトしてくれるので、内部インスタンスのツリーにかなり近いものを得ることができます：

source: To complete this refactoring, we will introduce a function that mounts a complete tree into a container node, just like `ReactDOM.render()`.
ja: このリファクタリングを完了するため、コンテナノードへ完成したツリーをマウントする、`ReactDOM.render()` のような関数を導入します。

source: It returns a public instance, also like `ReactDOM.render()`:
ja: この関数は `ReactDOM.render()` のように公開インスタンスを返します：

source: ### Unmounting {#unmounting}
ja: ### アンマウント {#unmounting}

source: Now that we have internal instances that hold onto their children and the DOM nodes, we can implement unmounting.
ja: これで、子内部インスタンスと DOM ノードを持った内部インスタンスができ、そこにアンマウントを実装できるようになります。

source: For a composite component, unmounting calls a lifecycle method and recurses.
ja: composite 要素では、アンマウントはライフサイクルメソッドを呼び出し、再帰的な処理を行います。

source: For `DOMComponent`, unmounting tells each child to unmount:
ja: `DOMComponent` では、アンマウントは子要素それぞれにアンマウントするように伝えます：

source: In practice, unmounting DOM components also removes the event listeners and clears some caches, but we will skip those details.
ja: 実際には、DOM コンポーネントをアンマウントすると、イベントリスナの削除とキャッシュのクリアも行われますが、これらの詳細は省略します。

source: We can now add a new top-level function called `unmountTree(containerNode)` that is similar to `ReactDOM.unmountComponentAtNode()`:
ja: これで `ReactDOM.unmountComponentAtNode()` と同様の `unmountTree(containerNode)` という新規の最上位関数を追加することができます：

source: In order for this to work, we need to read an internal root instance from a DOM node.
ja: これが動作するよう、DOM ノードから内部ルートインスタンスを読み込む必要があります。

source: We will modify `mountTree()` to add the `_internalInstance` property to the root DOM node.
ja: `mountTree()` を変更して、ルート DOM ノードに `_internalInstance` プロパティを追加します。

source: We will also teach `mountTree()` to destroy any existing tree so it can be called multiple times:
ja: `mountTree()` に既存の全てのツリーを破棄するようにも伝えて、複数回 `mountTree()` を呼び出せるようにします：

source: Now, running `unmountTree()`, or running `mountTree()` repeatedly, removes the old tree and runs the `componentWillUnmount()` lifecycle method on components.
ja: これで、`unmountTree()` を実行したり、`mountTree()` の実行を繰り返したりしても、古いツリーは破棄され、コンポーネント上で `componentWillUnmount()` ライフサイクルメソッドが実行されるようになりました。

source: ### Updating {#updating}
ja: ### 更新 {#updating}

source: In the previous section, we implemented unmounting.
ja: 前節では、アンマウント機能を実装しました。

source: However React wouldn't be very useful if each prop change unmounted and mounted the whole tree.
ja: しかし、各プロパティに変更があるたびにツリー全体をマウントしたりアンマウントしたりするようでは、React の使い勝手はあまり良いとは言えません。

source: The goal of the reconciler is to reuse existing instances where possible to preserve the DOM and the state:
ja: リコンサイラの目標は、DOM と state を保持できるように既存のインスタンスを再利用することです。

source: We will extend our internal instance contract with one more method.
ja: もう 1 つメソッドを追加して内部インスタンスを拡張しましょう。

source: In addition to `mount()` and `unmount()`, both `DOMComponent` and `CompositeComponent` will implement a new method called `receive(nextElement)`:
ja: `mount()` と `unmount()` に加えて、`DOMComponent` と `CompositeComponent` の両方に `receive(nextElement)` と呼ばれる新しいメソッドを実装しましょう：

source: Its job is to do whatever is necessary to bring the component (and any of its children) up to date with the description provided by the `nextElement`.
ja: このメソッドは、`nextElement` から受け取った指示に従って、コンポーネント（および全ての子要素）を最新の状態にするために必要なあらゆる作業を行う役割を担います。

source: This is the part that is often described as "virtual DOM diffing" although what really happens is that we walk the internal tree recursively and let each internal instance receive an update.
ja: 実際に行われているのは、内部ツリーを再帰的に巡回して各内部インスタンスが更新を受け取れるようにすることなのですが、この処理こそ「仮想 DOM の差分処理 (diffing)」としてしばしば説明される部分です。

source: ### Updating Composite Components {#updating-composite-components}
ja: ### composite コンポーネントの更新 {#updating-composite-components}

source: When a composite component receives a new element, we run the `componentWillUpdate()` lifecycle method.
ja: composite コンポーネントが新たな要素を受け取るときに、`componentWillUpdate()` ライフサイクルメソッドを実行します。

source: Then we re-render the component with the new props, and get the next rendered element:
ja: それからコンポーネントを新たな props で再レンダーし、レンダーされた次の要素を取得します：

source: Next, we can look at the rendered element's `type`.
ja: 続いて、レンダーされた要素の `type` を見てみましょう。

source: If the `type` has not changed since the last render, the component below can also be updated in place.
ja: もし最後のレンダー以降、`type` が変更されていなければ、これより下のコンポーネントもその場で更新されれば良いということになります。

source: For example, if it returned `<Button color="red" />` the first time, and `<Button color="blue" />` the second time, we can just tell the corresponding internal instance to `receive()` the next element:
ja: 例えばコンポーネントが最初に `<Button color="red" />` を返し、2 回目に `<Button color="blue" />` を返したなら、対応する内部インスタンスに次の要素を receive() するよう伝えるだけでよいのです：

source: However, if the next rendered element has a different `type` than the previously rendered element, we can't update the internal instance.
ja: ただし、レンダーされた次の要素が前のものと異なる `type` である場合、内部インスタンスの更新はできません。

source: A `<button>` can't "become" an `<input>`.
ja: `<button>` が `<input>` に「なる」ことはできないのです。

source: Instead, we have to unmount the existing internal instance and mount the new one corresponding to the rendered element type.
ja: 代わりに、既存の内部インスタンスをアンマウントし、レンダーされた要素の型に対応する新たな内部インスタンスをマウントします。

source: For example, this is what happens when a component that previously rendered a `<button />` renders an `<input />`:
ja: 例えば、前に `<button />` をレンダーしていたコンポーネントが `<input />` をレンダーした場合には、この処理が発生します：

source: To sum this up, when a composite component receives a new element, it may either delegate the update to its rendered internal instance, or unmount it and mount a new one in its place.
ja: まとめると、composite コンポーネントは新たな要素を受け取った際に、レンダーされた内部インスタンスに更新を委任するか、もしくは内部インスタンスをアンマウントしてそこに新しいものをマウントする、ということになります。

source: There is another condition under which a component will re-mount rather than receive an element, and that is when the element's `key` has changed.
ja: もう 1 つ、コンポーネントが要素を受け取らずに再マウントする状況があります。それは要素の `key` が変更された時です。

source: We don't discuss `key` handling in this document because it adds more complexity to an already complex tutorial.
ja: 既に複雑なチュートリアルがさらに複雑になってしまうので、このドキュメントでは `key` の取り扱いについては言及しません。

source: Note that we needed to add a method called `getHostNode()` to the internal instance contract so that it's possible to locate the platform-specific node and replace it during the update.
ja: プラットフォーム固有のノードを配置して更新時に置換できるよう、`getHostNode()` と呼ばれるメソッドを内部インスタンスに追加する必要があったことに注意してください。

source: Its implementation is straightforward for both classes:
ja: その実装は両方のクラスで簡単にできます：

source: ### Updating Host Components {#updating-host-components}
ja: ### host コンポーネントの更新 {#updating-host-components}

source: Host component implementations, such as `DOMComponent`, update differently.
ja: `DOMComponent` のような host コンポーネントの実装では、異なった更新を行います。

source: When they receive an element, they need to update the underlying platform-specific view.
ja: 要素を受け取る際、背後のプラットフォーム固有のビューを更新する必要があるのです。

source: In case of React DOM, this means updating the DOM attributes:
ja: React DOM の場合、これは DOM 属性の更新を意味します：

source: Then, host components need to update their children.
ja: そして、host コンポーネントは子コンポーネントを更新する必要があります。

source: Unlike composite components, they might contain more than a single child.
ja: composite コンポーネントと異なり、host コンポーネントは 1 つ以上の子コンポーネントを保有している可能性があります。

source: In this simplified example, we use an array of internal instances and iterate over it, either updating or replacing the internal instances depending on whether the received `type` matches their previous `type`.
ja: この簡素化した例では内部インスタンスの配列を用い、受け取った `type` と以前の `type` が一致するかによって、内部インスタンスを更新もしくは置換しながら、配列をイテレートしています。

source: The real reconciler also takes element's `key` in the account and track moves in addition to insertions and deletions, but we will omit this logic.
ja: 実際のリコンサイラでは処理時に要素の `key` を考慮して、要素の挿入と削除に加えて移動を追跡しますが、そのロジックは省略しています。

source: We collect DOM operations on children in a list so we can execute them in batch:
ja: リストの子要素への DOM 操作は、バッチで実行できるようまとめておきます：

source: As the last step, we execute the DOM operations.
ja: 最後のステップとして、DOM 操作を実行します。

source: Again, the real reconciler code is more complex because it also handles moves:
ja: ここでも、実際のリコンサイラのコードは要素の移動を扱わなければいけないので、より複雑になります：

source: And that is it for updating host components.
ja: host コンポーネントの更新については以上です。

source: ### Top-Level Updates {#top-level-updates}
ja: ### 最上位コンポーネントの更新 {#top-level-updates}
